In [1]:
import pandas as pd

In [2]:
data = pd.read_excel("strategy_results_train.xlsx")

In [3]:
data.head()

,id,label,date,open,high,low,close,volume,ma5,ma10,ma15,ma60
0,SHSE.600085_201501,0,2014-12-30,20.900000,22.090000,20.799999,22.049999,25457468,21.291999,21.369,21.636000,19.99367
1,SHSE.600085_201502,1,2015-01-30,22.990000,23.190001,22.510000,22.580000,7880595,23.320000,23.386,23.590000,21.59067
2,SHSE.600085_201503,1,2015-02-27,22.520000,22.670000,22.400000,22.540001,9263796,22.442000,22.106,22.165333,22.35100
3,SHSE.600085_201504,1,2015-03-30,26.219999,26.440001,25.820000,26.230000,16125626,26.378000,25.148,24.380667,23.21917
4,SHSE.600085_201505,1,2015-04-29,32.580002,33.639999,32.279999,33.180000,13959795,32.888000,32.902,32.436000,25.91067

In [4]:
data2 = pd.concat( [data.iloc[:, 1], data.iloc[:, 8:]], axis=1)

In [5]:
data2.head()

   label        ma5    ma10       ma15      ma60
0      0  21.291999  21.369  21.636000  19.99367
1      1  23.320000  23.386  23.590000  21.59067
2      1  22.442000  22.106  22.165333  22.35100
3      1  26.378000  25.148  24.380667  23.21917
4      1  32.888000  32.902  32.436000  25.91067

In [6]:
data2.isnull().any()

label    False
ma5       True
ma10      True
ma15      True
ma60      True
dtype: bool

In [7]:
data2 = data2.fillna(1)
data2.isnull().any()

label    False
ma5      False
ma10     False
ma15     False
ma60     False
dtype: bool

In [8]:
y = data2["label"]
y

0        0
1        1
2        1
3        1
4        1
        ..
31942    1
31943    0
31944    0
31945    0
31946    0
Name: label, Length: 31947, dtype: int64

In [9]:
X = data2.iloc[:, 1:]

In [10]:
X

             ma5       ma10       ma15      ma60
0      21.291999  21.369000  21.636000  19.99367
1      23.320000  23.386000  23.590000  21.59067
2      22.442000  22.106000  22.165333  22.35100
3      26.378000  25.148000  24.380667  23.21917
4      32.888000  32.902000  32.436000  25.91067
...          ...        ...        ...       ...
31942  58.442000  60.356001  60.682667  52.43767
31943  56.290000  55.929000  56.114000  56.81417
31944  55.034000  53.455999  52.943999  55.80117
31945  45.882000  47.193000  49.858000  53.32583
31946  49.150001  50.371001  51.181334  51.57283

[31947 rows x 4 columns]

In [12]:
X = X.fillna(1)

In [13]:
X.isnull().any()

ma5     False
ma10    False
ma15    False
ma60    False
dtype: bool

In [14]:
X.shape

(31947, 4)

In [15]:
from sklearn.ensemble import RandomForestClassifier
clf = RandomForestClassifier()
clf.fit(X, y)

/opt/anaconda3/lib/python3.6/site-packages/sklearn/ensemble/forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=10,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [23]:
testdata = pd.read_excel("sampleSubmission.xlsx")

In [24]:
testdata = testdata.fillna(1)
testdata.isnull().any()

id       False
label    False
ma5      False
ma10     False
ma15     False
ma60     False
dtype: bool

In [25]:
testdata.iloc[:, 2:]

          ma5    ma10      ma15      ma60
0      27.258  27.573  28.19800  29.11100
1      26.624  26.698  26.72467  28.23317
2      28.890  28.863  28.40867  27.89333
3      29.532  30.037  30.15733  28.39567
4      31.514  32.125  32.19200  30.08533
...       ...     ...       ...       ...
11358  86.210  86.955  86.35733  78.25750
11359  77.136  80.214  82.66200  82.29283
11360  70.966  71.855  72.97133  80.88133
11361  82.976  79.619  77.53067  78.34433
11362  81.462  82.899  84.11867  78.17567

[11363 rows x 4 columns]

In [26]:
result = clf.predict(testdata.iloc[:, 2:])

In [27]:
pd.DataFrame(result).to_excel("prediction.xlsx", index=False)